### NLP Modules
#### Ratio of class labels

In [1]:
# import packages/modules 

import pandas as pd
from class_ratio import ratio_

In [2]:
df = pd.read_fwf('training', header=None, usecols=[0])

In [7]:
df.head(5)

                                            Question Class
0  How did serfdom develop in and then leave Russ...  DESC
1   What films featured the character Popeye Doyle ?  ENTY
2  How can I find a list of celebrities ' real na...  DESC
3  What fowl grabs the spotlight after the Chines...  ENTY
4                    What is the full form of .com ?  ABBR

In [8]:
df_ratio = ratio_(df, 'Class')
df_ratio

  class  total
0  ENTY   3627
1   HUM   3424
2  DESC   3304
3   NUM   2480
4   LOC   2376
5  ABBR    241